IDEA StatiCa Open Model
CrossSectionFactory.FillColdFormedGeneral Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill center line for general cold formed css
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillColdFormedGeneral(
	CrossSectionGeneralColdFormed gcf,
	Region2D region2D,
	double Thickness,
	double InsideRadius
)
Public Shared Sub FillColdFormedGeneral (
	gcf As CrossSectionGeneralColdFormed,
	region2D As Region2D,
	Thickness As Double,
	InsideRadius As Double
)
public:
static void FillColdFormedGeneral(
	CrossSectionGeneralColdFormed^ gcf,
	Region2D^ region2D,
	double Thickness,
	double InsideRadius
)
Parameters
gcf
Type: IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed
[Missing <param name="gcf"/> documentation for "M:IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedGeneral(IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed,IdeaRS.OpenModel.Geometry2D.Region2D,System.Double,System.Double)"]
region2D
Type: IdeaRS.OpenModel.Geometry2D.Region2D
We need PolyLine2D from region2D
Thickness
Type: System.Double
Thickness
InsideRadius
Type: System.Double
Inside radius
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace